eks/kustomize/loadtest/logs/benchmark/canary-deployment-control/avg-load-30m/rolling/avg-load-roll-3_2.log
time="2026-03-11T14:16:29Z" level=warning msg="Request Failed" error="Get \"http://transaction-service.thesis.svc.cluster.local/pay\": dial tcp 10.100.151.117:80: connect: connection refused"
time="2026-03-11T14:16:29Z" level=error msg="TypeError: Cannot read property 'match' of undefined or null\n\tat file:///test/test.js:46:39(8)\n\tat go.k6.io/k6/internal/js/modules/k6.(*K6).Group-fm (native)\n\tat default (file:///test/test.js:43:10(11))\n" executor=constant-arrival-rate scenario=baseline_load source=stacktrace
time="2026-03-11T14:16:29Z" level=warning msg="Request Failed" error="Get \"http://transaction-service.thesis.svc.cluster.local/pay\": dial tcp 10.100.151.117:80: connect: connection refused"
time="2026-03-11T14:16:29Z" level=error msg="TypeError: Cannot read property 'match' of undefined or null\n\tat file:///test/test.js:46:39(8)\n\tat go.k6.io/k6/internal/js/modules/k6.(*K6).Group-fm (native)\n\tat default (file:///test/test.js:43:10(11))\n" executor=constant-arrival-rate scenario=baseline_load source=stacktrace
time="2026-03-11T14:16:29Z" level=warning msg="Request Failed" error="Get \"http://shop-service.thesis.svc.cluster.local/shop\": dial tcp 10.100.175.49:80: connect: connection refused"
time="2026-03-11T14:16:29Z" level=error msg="TypeError: Cannot read property 'match' of undefined or null\n\tat file:///test/test.js:29:38(8)\n\tat go.k6.io/k6/internal/js/modules/k6.(*K6).Group-fm (native)\n\tat default (file:///test/test.js:26:10(5))\n" executor=constant-arrival-rate scenario=baseline_load source=stacktrace
time="2026-03-11T14:16:29Z" level=warning msg="Request Failed" error="Get \"http://shop-service.thesis.svc.cluster.local/shop\": dial tcp 10.100.175.49:80: connect: connection refused"
time="2026-03-11T14:16:29Z" level=warning msg="Request Failed" error="Get \"http://shop-service.thesis.svc.cluster.local/shop\": dial tcp 10.100.175.49:80: connect: connection refused"
time="2026-03-11T14:16:29Z" level=warning msg="Request Failed" error="Get \"http://shop-service.thesis.svc.cluster.local/shop\": dial tcp 10.100.175.49:80: connect: connection refused"
time="2026-03-11T14:16:29Z" level=error msg="TypeError: Cannot read property 'match' of undefined or null\n\tat file:///test/test.js:29:38(8)\n\tat go.k6.io/k6/internal/js/modules/k6.(*K6).Group-fm (native)\n\tat default (file:///test/test.js:26:10(5))\n" executor=constant-arrival-rate scenario=baseline_load source=stacktrace
time="2026-03-11T14:16:29Z" level=error msg="TypeError: Cannot read property 'match' of undefined or null\n\tat file:///test/test.js:29:38(8)\n\tat go.k6.io/k6/internal/js/modules/k6.(*K6).Group-fm (native)\n\tat default (file:///test/test.js:26:10(5))\n" executor=constant-arrival-rate scenario=baseline_load source=stacktrace
time="2026-03-11T14:16:29Z" level=error msg="TypeError: Cannot read property 'match' of undefined or null\n\tat file:///test/test.js:29:38(8)\n\tat go.k6.io/k6/internal/js/modules/k6.(*K6).Group-fm (native)\n\tat default (file:///test/test.js:26:10(5))\n" executor=constant-arrival-rate scenario=baseline_load source=stacktrace
time="2026-03-11T14:16:29Z" level=warning msg="Request Failed" error="Get \"http://shop-service.thesis.svc.cluster.local/shop\": dial tcp 10.100.175.49:80: connect: connection refused"
time="2026-03-11T14:16:29Z" level=error msg="TypeError: Cannot read property 'match' of undefined or null\n\tat file:///test/test.js:29:38(8)\n\tat go.k6.io/k6/internal/js/modules/k6.(*K6).Group-fm (native)\n\tat default (file:///test/test.js:26:10(5))\n" executor=constant-arrival-rate scenario=baseline_load source=stacktrace
time="2026-03-11T14:16:29Z" level=warning msg="Request Failed" error="Get \"http://transaction-service.thesis.svc.cluster.local/pay\": dial tcp 10.100.151.117:80: connect: connection refused"
time="2026-03-11T14:16:29Z" level=error msg="TypeError: Cannot read property 'match' of undefined or null\n\tat file:///test/test.js:46:39(8)\n\tat go.k6.io/k6/internal/js/modules/k6.(*K6).Group-fm (native)\n\tat default (file:///test/test.js:43:10(11))\n" executor=constant-arrival-rate scenario=baseline_load source=stacktrace
time="2026-03-11T14:16:30Z" level=warning msg="Request Failed" error="Get \"http://shop-service.thesis.svc.cluster.local/shop\": dial tcp 10.100.175.49:80: connect: connection refused"
time="2026-03-11T14:16:30Z" level=error msg="TypeError: Cannot read property 'match' of undefined or null\n\tat file:///test/test.js:29:38(8)\n\tat go.k6.io/k6/internal/js/modules/k6.(*K6).Group-fm (native)\n\tat default (file:///test/test.js:26:10(5))\n" executor=constant-arrival-rate scenario=baseline_load source=stacktrace


  █ TOTAL RESULTS 

    checks_total.......: 6479253 3599.58087/s
    checks_succeeded...: 66.66%  4319502 out of 6479253
    checks_failed......: 33.33%  2159751 out of 6479253

    ✓ shop service response status is 200
    ✗ shop version stable
      ↳  93% — ✓ 1007591 / ✗ 72286
    ✗ shop version canary
      ↳  6% — ✓ 72286 / ✗ 1007591
    ✓ transaction service response status is 200
    ✗ transaction version stable
      ↳  93% — ✓ 1011139 / ✗ 68735
    ✗ transaction version canary
      ↳  6% — ✓ 68735 / ✗ 1011139

    CUSTOM
    shop_version_count.................: 1079877 599.930978/s
    shop_version_distribution..........: 100.00% 1079877 out of 1079877
    transaction_version_count..........: 1079874 599.929312/s
    transaction_version_distribution...: 100.00% 1079874 out of 1079874

    HTTP
    http_req_blocked...................: avg=5.06µs  min=0s       med=2.76µs  max=276.48ms p(90)=4.58µs  p(95)=5.12µs  
    http_req_connecting................: avg=350ns   min=0s       med=0s      max=31.62ms  p(90)=0s      p(95)=0s      
    http_req_duration..................: avg=3.25ms  min=0s       med=1.33ms  max=1.1s     p(90)=3.7ms   p(95)=7.59ms  
      { expected_response:true }.......: avg=3.25ms  min=892.97µs med=1.33ms  max=1.1s     p(90)=3.7ms   p(95)=7.59ms  
    http_req_failed....................: 0.00%   9 out of 2159760
    http_req_receiving.................: avg=55.7µs  min=0s       med=25.22µs max=81.89ms  p(90)=95.32µs p(95)=141.29µs
    http_req_sending...................: avg=21.93µs min=0s       med=7.9µs   max=508.11ms p(90)=18.17µs p(95)=28.71µs 
    http_req_tls_handshaking...........: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s      
    http_req_waiting...................: avg=3.18ms  min=0s       med=1.27ms  max=1.1s     p(90)=3.59ms  p(95)=7.39ms  
    http_reqs..........................: 2159760 1199.86529/s

    EXECUTION
    dropped_iterations.................: 117     0.065/s
    iteration_duration.................: avg=6.76ms  min=1.32ms   med=2.99ms  max=1.85s    p(90)=9.02ms  p(95)=19.06ms 
    iterations.........................: 1079883 599.934312/s
    vus................................: 2       min=0                  max=85 
    vus_max............................: 105     min=37                 max=105

    NETWORK
    data_received......................: 259 MB  144 kB/s
    data_sent..........................: 216 MB  120 kB/s


  █ SCENARIO: baseline_load 

    checks_total.......: 6479253 3599.58087/s
    checks_succeeded...: 66.66%  4319502 out of 6479253
    checks_failed......: 33.33%  2159751 out of 6479253

    ✓ shop service response status is 200
    ✗ shop version stable
      ↳  93% — ✓ 1007591 / ✗ 72286
    ✗ shop version canary
      ↳  6% — ✓ 72286 / ✗ 1007591
    ✓ transaction service response status is 200
    ✗ transaction version stable
      ↳  93% — ✓ 1011139 / ✗ 68735
    ✗ transaction version canary
      ↳  6% — ✓ 68735 / ✗ 1011139

    CUSTOM
    shop_version_count.................: 1079877 599.930978/s
    shop_version_distribution..........: 100.00% 1079877 out of 1079877
    transaction_version_count..........: 1079874 599.929312/s
    transaction_version_distribution...: 100.00% 1079874 out of 1079874

    HTTP
    http_req_blocked...................: avg=5.06µs  min=0s     med=2.76µs  max=276.48ms p(90)=4.58µs  p(95)=5.12µs  
    http_req_connecting................: avg=350ns   min=0s     med=0s      max=31.62ms  p(90)=0s      p(95)=0s      
    http_req_duration..................: avg=3.25ms  min=0s     med=1.33ms  max=1.1s     p(90)=3.7ms   p(95)=7.59ms  
    http_req_failed....................: 0.00%   9 out of 2159760
    http_req_receiving.................: avg=55.7µs  min=0s     med=25.22µs max=81.89ms  p(90)=95.32µs p(95)=141.29µs
    http_req_sending...................: avg=21.93µs min=0s     med=7.9µs   max=508.11ms p(90)=18.17µs p(95)=28.71µs 
    http_req_tls_handshaking...........: avg=0s      min=0s     med=0s      max=0s       p(90)=0s      p(95)=0s      
    http_req_waiting...................: avg=3.18ms  min=0s     med=1.27ms  max=1.1s     p(90)=3.59ms  p(95)=7.39ms  
    http_reqs..........................: 2159760 1199.86529/s

    EXECUTION
    dropped_iterations.................: 117     0.065/s
    iteration_duration.................: avg=6.76ms  min=1.32ms med=2.99ms  max=1.85s    p(90)=9.02ms  p(95)=19.06ms 
    iterations.........................: 1079883 599.934312/s

    NETWORK
    data_received......................: 259 MB  144 kB/s
    data_sent..........................: 216 MB  120 kB/s

    ↳ GROUP: shop 

      checks_total.......: 3239631 1799.792935/s
      checks_succeeded...: 66.66%  2159754 out of 3239631
      checks_failed......: 33.33%  1079877 out of 3239631

      ✓ shop service response status is 200
      ✗ shop version stable
          ↳  93% — ✓ 1007591 / ✗ 72286
      ✗ shop version canary
          ↳  6% — ✓ 72286 / ✗ 1007591

      CUSTOM
      shop_version_count..........: 1079877 599.930978/s
      shop_version_distribution...: 100.00% 1079877 out of 1079877

      HTTP
      http_req_blocked............: avg=5.95µs  min=0s med=3.27µs  max=276.48ms p(90)=4.93µs   p(95)=5.68µs  
      http_req_connecting.........: avg=318ns   min=0s med=0s      max=21.42ms  p(90)=0s       p(95)=0s      
      http_req_duration...........: avg=3.16ms  min=0s med=1.33ms  max=1.1s     p(90)=3.81ms   p(95)=7.53ms  
      http_req_failed.............: 0.00%   6 out of 1079883
      http_req_receiving..........: avg=58.17µs min=0s med=26.43µs max=81.84ms  p(90)=101.09µs p(95)=144.43µs
      http_req_sending............: avg=21.15µs min=0s med=8.84µs  max=508.11ms p(90)=18.95µs  p(95)=25.79µs 
      http_req_tls_handshaking....: avg=0s      min=0s med=0s      max=0s       p(90)=0s       p(95)=0s      
      http_req_waiting............: avg=3.08ms  min=0s med=1.27ms  max=1.1s     p(90)=3.7ms    p(95)=7.35ms  
      http_reqs...................: 1079883 599.934312/s

    ↳ GROUP: transaction 

      checks_total.......: 3239622 1799.787935/s
      checks_succeeded...: 66.66%  2159748 out of 3239622
      checks_failed......: 33.33%  1079874 out of 3239622

      ✓ transaction service response status is 200
      ✗ transaction version stable
          ↳  93% — ✓ 1011139 / ✗ 68735
      ✗ transaction version canary
          ↳  6% — ✓ 68735 / ✗ 1011139

      CUSTOM
      transaction_version_count..........: 1079874 599.929312/s
      transaction_version_distribution...: 100.00% 1079874 out of 1079874

      HTTP
      http_req_blocked...................: avg=4.17µs  min=0s med=2.23µs  max=57.31ms  p(90)=3.24µs  p(95)=3.71µs  
      http_req_connecting................: avg=382ns   min=0s med=0s      max=31.62ms  p(90)=0s      p(95)=0s      
      http_req_duration..................: avg=3.35ms  min=0s med=1.32ms  max=982.14ms p(90)=3.59ms  p(95)=7.67ms  
      http_req_failed....................: 0.00%   3 out of 1079877
      http_req_receiving.................: avg=53.23µs min=0s med=24.01µs max=81.89ms  p(90)=88.34µs p(95)=137.58µs
      http_req_sending...................: avg=22.71µs min=0s med=7.18µs  max=437.35ms p(90)=17.02µs p(95)=38.03µs 
      http_req_tls_handshaking...........: avg=0s      min=0s med=0s      max=0s       p(90)=0s      p(95)=0s      
      http_req_waiting...................: avg=3.27ms  min=0s med=1.27ms  max=982.01ms p(90)=3.47ms  p(95)=7.45ms  
      http_reqs..........................: 1079877 599.930978/s